docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-31 Tue 18:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weather Research and Forecast (WRF) Scaling, Performance Assessment and Optimization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Akira Kyle" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Weather Research and Forecast (WRF) Scaling, Performance Assessment and Optimization
<br />
<span class="subtitle">NCAR SIParCS Program 2018</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#git_directories">git directories</a></li>
<li><a href="#how_to_run_example">Example of how to run the <code>new_conus12km</code> benchmark case</a></li>
<li><a href="#benchmark_data">Data Sources for the various benchmark cases</a>
<ul>
<li><a href="#katrina"><code>katrina</code> (1km, 3km, 30km)</a></li>
<li><a href="#conus"><code>conus12km</code> and <code>conus2.5km</code></a></li>
<li><a href="#maria_and_new_conus"><code>maria1km</code>, <code>maria3km</code>, and <code>new_conus12km</code> and <code>new_conus2.5km</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="warning">
<p>
This is still very much a work in progress!
</p>

</div>

<p>
This repo contains the benchmark cases and scripts used for assessing the
scaling performance of WRF on NCAR's Cheyenne Supercomputer.
</p>

<p>
<a href="results.html">The results of this study can be found here.</a>
</p>

<div id="outline-container-org4a0d197" class="outline-2">
<h2 id="git_directories"><a id="org4a0d197"></a>git directories</h2>
<div class="outline-text-2" id="text-git_directories">
<ul class="org-ul">
<li><code>cases/</code> contains the namelists for WPS and WRF for the various benchmark
cases along with scripts for generating the <code>wrfbdy</code> and <code>wrfinput</code> files for
each case.</li>
<li><code>scripts/</code> contains useful scripts for automating the compilation, running,
and analysis of the WRF test cases. Pass the <code>--help</code> flag to see how to use
each.</li>
<li><code>WRFs</code> contains job scripts for compiling the various combinations of WRF
versions, compiler versions and options, and MPI versions used in these
performance assessments.</li>
<li><code>WPSs</code> contains job scripts for compiling the various WPS versions used to
generate WRF input data.</li>
<li><code>docs/</code> contains this documentation along with the timing and scaling results
and associated analysis and plotting code used to generate the results.</li>
</ul>
</div>
</div>

<div id="outline-container-org99fe5cc" class="outline-2">
<h2 id="how_to_run_example"><a id="org99fe5cc"></a>Example of how to run the <code>new_conus12km</code> benchmark case</h2>
<div class="outline-text-2" id="text-how_to_run_example">
<p>
As always, change the example paths to your directory structure. All the scripts
in the <code>srcipts/</code> directory do not hardcode paths (except <code>wrf_run_pbs_jobs</code> has
a default run directory) but the scripts in the <code>cases/</code> directory do hardcode
paths. All the job submission scripts in <code>WRFs</code> and <code>WPSs</code> also hardcode paths.
</p>

<p>
The following will give you a table with timing results using the
<code>new_conus12km</code> benchmark with WRFV4.0 compiled with intel18.0.1 and mpt2.18
scaled across 1, 2, 4, 8 nodes on cheyenne. (cheyenne's 36 cores/node is the
default in <code>wrf_run_pbs_jobs</code>)
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">JASPERLIB</span>=/glade/u/home/wrfhelp/UNGRIB_LIBRARIES/lib
<span class="org-builtin">export</span> <span class="org-variable-name">JASPERINC</span>=/glade/u/home/wrfhelp/UNGRIB_LIBRARIES/include
<span class="org-builtin">alias</span> <span class="org-variable-name">qsub</span>=<span class="org-string">'/opt/pbs/bin/qsub -A MY_ACCOUNT_CODE -m abe -M my_email_address'</span>

git clone https://github.com/akirakyle/WRF_benchmarks.git

qsub WRF_benchmarks/WRFs/WRFV4.0-intel18.0.1-mpt2.18.pbs
qstat <span class="org-comment-delimiter"># </span><span class="org-comment">wait for job to finish...</span>
qsub WRF_benchmarks/WPSs/WPSV4.0-intel18.0.1.pbs
qstat <span class="org-comment-delimiter"># </span><span class="org-comment">wait for job to finish...</span>
./WRF_benchmarks/cases/make_cases_new.sh
qstat <span class="org-comment-delimiter"># </span><span class="org-comment">wait for job to finish...</span>
./WRF_benchmarks/wrf_run_pbs_jobs -c ~/WRF_benchmarks/cases/new_conus12km <span class="org-sh-escaped-newline">\</span>
                                  -w ~/work/WRFs/WRFV4.0-intel18.0.1-mpt2.18 <span class="org-sh-escaped-newline">\</span>
                                  -n 1 2 4 8 -r ./run <span class="org-sh-escaped-newline">\</span>
                                  -p <span class="org-string">'-A MY_ACCOUNT_CODE -m abe -M my_email_address'</span>
qstat <span class="org-comment-delimiter"># </span><span class="org-comment">wait for jobs to finish...</span>
<span class="org-builtin">cd</span> run
./WRF_benchmarks/wrf_cpy_rsl -a ../archive -o ../results -r *
<span class="org-builtin">cd</span> ../results
./WRF_benchmarks/wrf_stats *
</pre>
</div>

<div class="note">
<p>
I made heavy use of <a href="https://orgmode.org/">emacs org mode</a> for automating the above workflow of creating
runs, submitting them, and plotting their output. In particular I made use of
the <a href="https://orgmode.org/worg/org-contrib/babel/intro.html">babel feature in org mode</a> and its integration with <a href="https://www.gnu.org/software/tramp/">TRAMP mode</a>. I eventually
needed a more flexible solution than provided by the <code>wrf_run_pbs_job</code> script to
manage all the pbs job submission scripts so I created the bash source block in
in <code>docs/runs.org</code> file to run, manage, and document all the jobs I was
submitting to Cheyenne. The <code>wrf_stats</code> script outputs an org mode compatible
table, so I can use the <code>docs/data.org</code> file to save all the wrf timing results.
I can then reference this table of data in the analysis code blocks in
<code>docs/results.org</code>.
</p>

<p>
Of course this document itself is also written in org mode and exported to html.
Be wary of the fact that github does render org mode documents as if it was
markdown, however this often leaves out valuable information present in the raw
org mode text.
</p>

</div>
</div>
</div>

<div id="outline-container-org6c02413" class="outline-2">
<h2 id="benchmark_data"><a id="org6c02413"></a>Data Sources for the various benchmark cases</h2>
<div class="outline-text-2" id="text-benchmark_data">
</div>
<div id="outline-container-orgb9a3d0f" class="outline-3">
<h3 id="katrina"><a id="orgb9a3d0f"></a><code>katrina</code> (1km, 3km, 30km)</h3>
<div class="outline-text-3" id="text-katrina">
<p>
Data for running the Hurricane Katrina cases can be downloaded from the WRF
tutorial page
</p>

<div class="org-src-container">
<pre class="src src-sh">curl http://www2.mmm.ucar.edu/wrf/TUTORIAL_DATA/Katrina.tar.gz -o Katrina.tar.gz
tar -xf Katrina.tar
</pre>
</div>

<p>
The 30km case is the same namelist as shown in the WRF-ARW tutorial at
<a href="http://www2.mmm.ucar.edu/wrf/OnLineTutorial/CASES/SingleDomain/index.html">http://www2.mmm.ucar.edu/wrf/OnLineTutorial/CASES/SingleDomain/index.html</a>
</p>

<p>
WPS and <code>real.exe</code> must be run to generate <code>wrfbdy_d01</code> and <code>wrfrst_d01</code> for
these cases
</p>
</div>
</div>

<div id="outline-container-orgc7dd6ae" class="outline-3">
<h3 id="conus"><a id="orgc7dd6ae"></a><code>conus12km</code> and <code>conus2.5km</code></h3>
<div class="outline-text-3" id="text-conus">
<p>
The <code>wrfbdy_d01</code> and <code>wrfrst_d01</code> files for the official CONUS benchmarks at
12km and 2.5km resolution can be found at:
<a href="http://www2.mmm.ucar.edu/wrf/WG2/benchv3/">http://www2.mmm.ucar.edu/wrf/WG2/benchv3/</a>
</p>
</div>
</div>

<div id="outline-container-org04c9688" class="outline-3">
<h3 id="maria_and_new_conus"><a id="org04c9688"></a><code>maria1km</code>, <code>maria3km</code>, and <code>new_conus12km</code> and <code>new_conus2.5km</code></h3>
<div class="outline-text-3" id="text-maria_and_new_conus">
<p>
The data for these Hurricane Maria cases and CONUS cases comes from the NCEP GFS
Model Runs which can be downloaded form <a href="https://rda.ucar.edu/datasets/ds084.1/">https://rda.ucar.edu/datasets/ds084.1/</a>.
However this data already resides on glade, so the WPS scripts just link in the
appropriate glade directories.
</p>

<p>
WPS and <code>real.exe</code> must be run to generate <code>wrfbdy_d01</code> and <code>wrfrst_d01</code> for
these cases
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akira Kyle</p>
<p class="email">Email: <a href="mailto:akyle@cmu.edu">akyle@cmu.edu</a></p>
<p class="date">Created: 2018-07-31 Tue 18:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
